#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.chat must be replaced
-/+ resource "google_compute_instance" "chat" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/cmc-things/zones/northamerica-northeast1-a/instances/chat" -> (known after apply)
      ~ instance_id             = "3171424216009659891" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "f1-micro"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "4o65tGLQ45s=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            #!/bin/bash
            
            set -euo pipefail
            
          - echo "Creating the synapse user"
          - id -u synapse &>/dev/null || useradd -u 1337 synapse
          + if [ ! -f GCSFUSE_IS_INSTALLED ]; then
          +   echo "Installing gcsfuse"
          +   GCSFUSE_REPO=gcsfuse-$(lsb_release -c -s)
          +   echo "deb http://packages.cloud.google.com/apt $GCSFUSE_REPO main" | tee /etc/apt/sources.list.d/gcsfuse.list
          +   curl https://packages.cloud.google.com/apt/doc/apt-key.gpg | apt-key add -
            
          +   apt-get update
          +   apt-get install gcsfuse
          +   touch GCSFUSE_IS_INSTALLED
          + fi
          + 
          + if [ ! id -u synapse > /dev/null 2>&1 ]; then
          +   echo "Creating the synapse user"
          +   useradd -u 1337 synapse
          +   usermod -a -G fuse synapse
          + fi
          + 
          + echo "Creating the mount point for keys"
          + mkdir keys
          + chown synapse:synapse keys
          + 
            echo "Dropping permissions"
            su - synapse
            
          + echo "Mounting the keys bucket"
          + gcsfuse cmc-chat-keys keys
          + 
          + export GIT_SSH_COMMAND='ssh -i ~/keys/github/deploy_key'
            if [ -d "cmc" ]; then
              echo "Repo directory exists; pulling"
              cd cmc
              git pull origin master
            else
              echo "Cloning repo"
              git clone ssh://git@github.com/j3parker/cmc
              cd cmc
            fi 
            
            echo "Starting containers"
            cd chat
            docker-compose up
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "chat"
      ~ project                 = "cmc-things" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/cmc-things/zones/northamerica-northeast1-a/instances/chat" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
        zone                    = "northamerica-northeast1-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/cmc-things/zones/northamerica-northeast1-a/disks/chat" -> (known after apply)

          ~ initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/gce-uefi-images/global/images/ubuntu-1804-bionic-v20191113"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/cmc-things/global/networks/default" -> "default"
          ~ network_ip         = "10.162.0.3" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/cmc-things/regions/northamerica-northeast1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "cmc-things" -> (known after apply)

          ~ access_config {
                nat_ip       = "34.95.33.143"
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform Test`, Action: `hashicorpterraform-github-actions3`, Working Directory: `terraform`*
